# wsDelete

## Description
Delete all menu commands and tools under the specified 'companyName' added with 'wsEditBegin'.

```pascal
PROCEDURE wsDelete(
				companyName : STRING;
				restart     : BOOLEAN;
				reload      : BOOLEAN);
```

```python
def vs.wsDelete(companyName, restart, reload):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|companyName|STRING|   |
|restart|BOOLEAN|   |
|reload|BOOLEAN|   |

## Version
Availability: from Vectorworks 2021

## Category
* Workspaces